examples/SunlessSea/Captain II.org
# -*- coding: utf-8 -*-
#+TITLE: Sunless Sea - Captain II
#+Author: Dou Meishi
#+STARTUP: indent
#+STARTUP: overview
#+HTML_LINK_HOME: ./stories.html
#+HTML_LINK_UP: ./Captain I.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="./ss-stories.css"/>

* Captain's Making

Three decades ago, in the region of Victoria, London was stolen by /bats/. Now it lies a mile below /the surface/.

It was dreadfully inconvenient for everyone. But it opened a vast black ocean to you. Welcome to /the Underzee/.

- ~Choose a Past~

You now lodge in a Room above /the Blind Helmsman/.

** Who Were You

Now you're a captain: now you belong to the Underzee. But who were you, before?

- ~A street urchin!~

Your urchin-gang cast you out when you grew too tall. You took to sea rather than graduate to larger crimes. That last big score was enough to buy a ship.

*Low cunning on the high seas*

Your friend, another longshanks, knows a little of gunnery. Only a little, but she can help.

** Choose An Ambition

What does winning mean to you?

- ~Wealth~

You know how it is to be poor. Now you want a mansion, servants, fine clothes. A family, perhaps.

The Underzee is full of riches. Death and darkness, too, but it's worth the gamble.

** A Last Scrap of Paperwork

Captain! Captain! An irregularity in the Harbourmaster's office! They wish to know - what term of address you prefer ashore?

- ~Captain~

'Captain' will do perfactly ashore as well as at sea. Thank you.

*Captain it is!*

#+begin_center
/A last piece of advice: explore. Take chances. This captain will probably die. The zee is hungry. But each captain passes on lessons to the next.../
#+end_center

* Fallen London

FALLEN LONDON! Deep, dark and marvellous. All voyages start here: and this is where successful voyages end.

- ~Advice For Captains~

The much-lamented M. Demeaux found a watery grave long, long ago. Probably you will end no better. But if you read this book of invaluable advice, your chances will improve.

- ~Sell this Book~

You are a vertern captain, and require no more advice? Very well, then.

*Sold!*

Someone else will better appreciate M. Demeaux's work.

- ~A Zubmarinar Tutorial~

Welcome, delicious friend!

- ~How to accquire a zubmarine~

Her Majesty's Admiralty has sworn off zubmarine exploration. However, you've heard tales of unofficial research into zubmarine travel being conducted in her distant colony.

#+begin_center
/Travel to the Southern coast, and follow it east to find Port Carnelian. There, you will learn how to convert your ship into a zubmarine. Be sure you're prepared for the journey!/
#+end_center

- ~Your Lodgings~

Here you may catch up with your correspondence, rest or retire altogether from the sea-faring life. The better your lodgins, the better your quality of retirement. Naturally.

- ~Read the Morning Papers~

The unexpurgated Gazette, the Magazine Formally Known as London Magazine, the Spiteful Trumpeter. News.

*News from home*

/The Echo Bazaar/, that enigmatic marketplace, has increased its tax on love stories. /The Traitor Empress/ has forbidden singing in the street outside her palace. The anarchists of /the Calendar Council/ has inexplicably dynamited a drinking-fountain. /The Ministry of Public Decency/ has located and destroyed a nest of gallblighter wasps...  

- ~London!~

She is the greaties city on the Underzee. And don't you forget it.

- ~Adopt a Blemmigan Gallivanter~

A Blemmigan sits atop a splintered crate, clinking and whistling at captains as they come near.

*A poliet bow*

You extend your hand and the Blemmigan leaps on. Its tendrils entwine with your fingers, and it chitters quietly. It meets your gaze and bobs its dome in greeting. It's very small - is it old enough for naval services? You're pretty sure its moustache has been drawn on in pen, in an attempt to look older. As you approach your ship's gangplank, the creature flutes and vibrates with apparent happiness. The bosun winces as you bring it aboard.

- ~Visit the Admiralty's Survey Office~

They'll pay for information from zee-captains. Find out what, and how.

** The Admiralty Survey Office

The Admiralty's picket fleets and intelligence networks are long gone. The Survey Office pays zee-captains a small sum for recent information.

- ~Ask if there's anything in particular they need~

"Well, if we can be assured of your discretion - "

*"This port - "*

"Speak to our agents there, and return. We'll see that you're rewarded."

- ~Ask to speak to a higher authority~

"Do you have an appointment?"

*Not as such...*

"Once you've proven yourself, perhaps."

- ~Leave the Admiralty~

"You don't have anything else for us?"

*Done*

Out into the foggy street. Turn your collar up.

** A Passenger

Someone in the docks wants to board your ship.

- ~Agree to carry the Anxious University Student to Hunter's Keep~

He has no money, so other captains have no interest. But he's passionate youth, and promises that his studies on lorn-flukes will be rewarding enough.

*Welcom aboard*

He jumps for joy as you agree to take him aboard. "Thank you, thank you! Please, take me to /Hunter's Keep/ right away. A lorn-fluke - a full, dead lorn-fluke! - washed ashore. I'm doing my thesis on them - do you know they can diggest human memory? - and I may never have a better chance to study one up close.

