examples/SunlessSea/Captain II.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-11-25 周四 12:46 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Sunless Sea - Captain II</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Dou Meishi">
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
<link rel="stylesheet" type="text/css" href="https://dou-meishi.github.io/orgcss/worg.css"/>
<link rel="stylesheet" type="text/css" href="https://dou-meishi.github.io/orgcss/dou-org.css"/>
<link rel="stylesheet" type="text/css" href="./ss-stories.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./Captain I.html"> UP </a>
 |
 <a accesskey="H" href="./stories.html"> HOME </a>
</div><div id="content">
<header>
<h1 class="title">Sunless Sea - Captain II</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd5941b1">Captain's Making</a>
<ul>
<li><a href="#orgb7e718c">Who Were You</a></li>
<li><a href="#orgb8af3b1">Choose An Ambition</a></li>
<li><a href="#orgd36e1e3">A Last Scrap of Paperwork</a></li>
</ul>
</li>
<li><a href="#org899db6d">Fallen London</a>
<ul>
<li><a href="#org2d02cf9">The Admiralty Survey Office</a></li>
<li><a href="#orgd44d0f0">A Passenger</a></li>
<li><a href="#orgebf5b6e">Your Comatose Ferret</a></li>
<li><a href="#org07d5109">Your Blemmigan Gallivanter</a></li>
<li><a href="#org0e1ecbf">Speak to the Longshanks Gunner</a></li>
<li><a href="#org6946cdd">Shops</a></li>
</ul>
</li>
<li><a href="#orgfc96a66">Light-Ship</a></li>
<li><a href="#org7c9fee6">Pigmote Isle</a>
<ul>
<li><a href="#orgec96a60">On A Lonely Desert Beach</a></li>
<li><a href="#orgc28bced">A Literary Interlude</a></li>
<li><a href="#org1349bac">The Rise of Pigmote Isle</a></li>
</ul>
</li>
<li><a href="#orge329b7c">BATTLE RESULT I</a>
<ul>
<li><a href="#org7af0a48">You've Destroyed a Rat-Barge</a></li>
<li><a href="#org9327988">Opening a Cache of Curiosities</a></li>
</ul>
</li>
<li><a href="#org4140ff3">Port Carnelian</a>
<ul>
<li><a href="#org334343c">Zubmariner: the Fierce Philanthropist</a></li>
<li><a href="#org9d5f976">Sherry with the Fierce Philanthropist</a></li>
<li><a href="#org9b3d495">The Hidden Workshop</a></li>
<li><a href="#orga5a6f18">Shops</a></li>
</ul>
</li>
<li><a href="#orgbcb958b">Grand Geode</a></li>
<li><a href="#org0f5d1ca">FIRE!</a></li>
<li><a href="#org84d03db">BATTLE RESULT II</a>
<ul>
<li><a href="#org5160447">You've Destroyed The Unfinished Revolutionaries</a></li>
<li><a href="#org64878e1">Opening A  Cache Of Curiosities</a></li>
</ul>
</li>
<li><a href="#orgf79fe87">A White Zee-Bat</a></li>
<li><a href="#org2be8d29">Cumaean Canal Staging Area</a>
<ul>
<li><a href="#orgb12dcbe">Shops</a></li>
</ul>
</li>
<li><a href="#org42f6aff">Sailing Logbook</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orgd5941b1" class="outline-2">
<h2 id="orgd5941b1">Captain's Making</h2>
<div class="outline-text-2" id="text-orgd5941b1">
<p>
Three decades ago, in the region of Victoria, London was stolen by <i>bats</i>. Now it lies a mile below <i>the surface</i>.
</p>

<p>
It was dreadfully inconvenient for everyone. But it opened a vast black ocean to you. Welcome to <i>the Underzee</i>.
</p>

<ul class="org-ul">
<li><code>Choose a Past</code></li>
</ul>

<p>
You now lodge in a Room above <i>the Blind Helmsman</i>.
</p>
</div>

<div id="outline-container-orgb7e718c" class="outline-3">
<h3 id="orgb7e718c">Who Were You</h3>
<div class="outline-text-3" id="text-orgb7e718c">
<p>
Now you're a captain: now you belong to the Underzee. But who were you, before?
</p>

<ul class="org-ul">
<li><code>A street urchin!</code></li>
</ul>

<p>
Your urchin-gang cast you out when you grew too tall. You took to sea rather than graduate to larger crimes. That last big score was enough to buy a ship.
</p>

<p>
<b>Low cunning on the high seas</b>
</p>

<p>
Your friend, another longshanks, knows a little of gunnery. Only a little, but she can help.
</p>
</div>
</div>

<div id="outline-container-orgb8af3b1" class="outline-3">
<h3 id="orgb8af3b1">Choose An Ambition</h3>
<div class="outline-text-3" id="text-orgb8af3b1">
<p>
What does winning mean to you?
</p>

<ul class="org-ul">
<li><code>Wealth</code></li>
</ul>

<p>
You know how it is to be poor. Now you want a mansion, servants, fine clothes. A family, perhaps.
</p>

<p>
The Underzee is full of riches. Death and darkness, too, but it's worth the gamble.
</p>
</div>
</div>

<div id="outline-container-orgd36e1e3" class="outline-3">
<h3 id="orgd36e1e3">A Last Scrap of Paperwork</h3>
<div class="outline-text-3" id="text-orgd36e1e3">
<p>
Captain! Captain! An irregularity in the Harbourmaster's office! They wish to know - what term of address you prefer ashore?
</p>

<ul class="org-ul">
<li><code>Captain</code></li>
</ul>

<p>
'Captain' will do perfactly ashore as well as at sea. Thank you.
</p>

<p>
<b>Captain it is!</b>
</p>

<div class="org-center">
<p>
<i>A last piece of advice: explore. Take chances. This captain will probably die. The zee is hungry. But each captain passes on lessons to the next&#x2026;</i>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org899db6d" class="outline-2">
<h2 id="org899db6d">Fallen London</h2>
<div class="outline-text-2" id="text-org899db6d">
<p>
FALLEN LONDON! Deep, dark and marvellous. All voyages start here: and this is where successful voyages end.
</p>

<ul class="org-ul">
<li><code>Advice For Captains</code></li>
</ul>

<p>
The much-lamented M. Demeaux found a watery grave long, long ago. Probably you will end no better. But if you read this book of invaluable advice, your chances will improve.
</p>

<ul class="org-ul">
<li><code>Sell this Book</code></li>
</ul>

<p>
You are a vertern captain, and require no more advice? Very well, then.
</p>

<p>
<b>Sold!</b>
</p>

<p>
Someone else will better appreciate M. Demeaux's work.
</p>

<ul class="org-ul">
<li><code>A Zubmarinar Tutorial</code></li>
</ul>

<p>
Welcome, delicious friend!
</p>

<ul class="org-ul">
<li><code>How to accquire a zubmarine</code></li>
</ul>

<p>
Her Majesty's Admiralty has sworn off zubmarine exploration. However, you've heard tales of unofficial research into zubmarine travel being conducted in her distant colony.
</p>

<div class="org-center">
<p>
<i>Travel to the Southern coast, and follow it east to find Port Carnelian. There, you will learn how to convert your ship into a zubmarine. Be sure you're prepared for the journey!</i>
</p>
</div>

<ul class="org-ul">
<li><code>Your Lodgings</code></li>
</ul>

<p>
Here you may catch up with your correspondence, rest or retire altogether from the sea-faring life. The better your lodgins, the better your quality of retirement. Naturally.
</p>

<ul class="org-ul">
<li><code>Read the Morning Papers</code></li>
</ul>

<p>
The unexpurgated Gazette, the Magazine Formally Known as London Magazine, the Spiteful Trumpeter. News.
</p>

<p>
<b>News from home</b>
</p>

<p>
<i>The Echo Bazaar</i>, that enigmatic marketplace, has increased its tax on love stories. <i>The Traitor Empress</i> has forbidden singing in the street outside her palace. The anarchists of <i>the Calendar Council</i> has inexplicably dynamited a drinking-fountain. <i>The Ministry of Public Decency</i> has located and destroyed a nest of gallblighter wasps&#x2026;  
</p>

<ul class="org-ul">
<li><code>London!</code></li>
</ul>

<p>
She is the greaties city on the Underzee. And don't you forget it.
</p>

<ul class="org-ul">
<li><code>Adopt a Blemmigan Gallivanter</code></li>
</ul>

<p>
A Blemmigan sits atop a splintered crate, clinking and whistling at captains as they come near.
</p>

<p>
<b>A poliet bow</b>
</p>

<p>
You extend your hand and the Blemmigan leaps on. Its tendrils entwine with your fingers, and it chitters quietly. It meets your gaze and bobs its dome in greeting. It's very small - is it old enough for naval services? You're pretty sure its moustache has been drawn on in pen, in an attempt to look older. As you approach your ship's gangplank, the creature flutes and vibrates with apparent happiness. The bosun winces as you bring it aboard.
</p>

<ul class="org-ul">
<li><code>Visit the Admiralty's Survey Office</code></li>
</ul>

<p>
They'll pay for information from zee-captains. Find out what, and how.
</p>
</div>

<div id="outline-container-org2d02cf9" class="outline-3">
<h3 id="org2d02cf9">The Admiralty Survey Office</h3>
<div class="outline-text-3" id="text-org2d02cf9">
<p>
The Admiralty's picket fleets and intelligence networks are long gone. The Survey Office pays zee-captains a small sum for recent information.
</p>

<ul class="org-ul">
<li><code>Ask if there's anything in particular they need</code></li>
</ul>

<p>
"Well, if we can be assured of your discretion - "
</p>

<p>
<b>"This port - "</b>
</p>

<p>
"Speak to our agents there, and return. We'll see that you're rewarded."
</p>

<ul class="org-ul">
<li><code>Ask to speak to a higher authority</code></li>
</ul>

<p>
"Do you have an appointment?"
</p>

<p>
<b>Not as such&#x2026;</b>
</p>

<p>
"Once you've proven yourself, perhaps."
</p>

<ul class="org-ul">
<li><code>Leave the Admiralty</code></li>
</ul>

<p>
"You don't have anything else for us?"
</p>

<p>
<b>Done</b>
</p>

<p>
Out into the foggy street. Turn your collar up.
</p>
</div>
</div>

<div id="outline-container-orgd44d0f0" class="outline-3">
<h3 id="orgd44d0f0">A Passenger</h3>
<div class="outline-text-3" id="text-orgd44d0f0">
<p>
Someone in the docks wants to board your ship.
</p>

<ul class="org-ul">
<li><code>Agree to carry the Anxious University Student to Hunter's Keep</code></li>
</ul>

<p>
He has no money, so other captains have no interest. But he's passionate youth, and promises that his studies on lorn-flukes will be rewarding enough.
</p>

<p>
<b>Welcom aboard</b>
</p>

<p>
He jumps for joy as you agree to take him aboard. "Thank you, thank you! Please, take me to <i>Hunter's Keep</i> right away. A lorn-fluke - a full, dead lorn-fluke! - washed ashore. I'm doing my thesis on them - do you know they can diggest human memory? - and I may never have a better chance to study one up close.
</p>
</div>
</div>
