examples/SunlessSea/Captain II.org
** Your Comatose Ferret

- ~Comatose Ferret (Mascot)~

Mostly, it's immobile. Occasionally, it's feral.

It lies across the deck like a lumpy scarf.

- ~Play with your Ferret~

Attract its attention.

*A weary roll of the eye*

Play, that eye-roll says. Play. I played once, in the happy warrens of London, before you installed me in this floating coffin and made me eat dried food. Damn your play. It is an eloquent eye-roll.

** Your Blemmigan Gallivanter

It has made its home on a shelf in your cabin. It has built a nest from loose journal pages, the engineer's scarf and a possibily pilfered map.

- ~Entertain your Blemmigan~

You can see the indentation of a porthole on the rim of its cap. It must have been pressing its face to the windows again. Is it bored?

*A ticklish thing*

The Blemmigan flails and squirms as you tickle it. Its high-pitched warble is almost certainly giggling. When you stop - to check that you're not actually hurting it - it warps its tendrils around your fingers and pulls your hand back. Apparently it is enjoying itself. 

** Speak to the Longshanks Gunner

"Orright, Captain. What do yer want me to shoot at now?"

- ~Ask what she wants from life~

Why did she come to zee?

*"Khan's Shadow"*

"It's like the Flit at zee, right? No one to tell yer what to say or do. And no one to kick yer downstairs just 'cos yer got a little bit tall. I'll be a faithful officer, but put me ashore at the Shadow, and I won't forget yer."

** Shops

Cargoes, treasures, weapons, secrets. Mischief.

- *Mrs. Plenty's Shipside Privisioners*

  A profitable sideline for the notorious carnival entrepreneuse.

  - Solacefruit

    - ~Buy: NaN, Sell: €50~

  - Fuel
    
    - ~Buy: €10, Sell: €2~

  - Flare

    - ~Buy: €10, Sell: €0~

  - Supplies

    - ~Buy: €20, Sell: €5~

  - Foxfire Candles

    - ~Buy: €40, Sell: €20~

- *WolfStack Exchange*

  Trading in common goods will only earn slim profits. Seek other opportunities.

  - Scintillack

    - ~Buy: NaN, Sell: €70~

  - Devilbone Dice

    - ~Buy: NaN, Sell: €20~

  - Mutersalt

    - ~Buy: NaN, Sell: €50~

  - Zzoup

    - ~Buy: NaN, Sell: €70~

  - Solacefruit

    - ~Buy: NaN, Sell: €50~

  - A Casket of Sapphires

    - ~Buy: NaN, Sell: €90~

  - Stygian Ivory

    - ~Buy: NaN, Sell: €28~

  - Royal-blue Feather

    - ~Buy: NaN, Sell: €1~

  - Approved Romantic Literature

    - ~Buy: NaN, Sell: €22~

  - Cask of Mushroom Wine

    - ~Buy: €21, Sell: €20~

  - Firkin of Prisoner's Honey

    - ~Buy: €25, Sell: €20~

  - Sack of Darkdrop Coffee Beans

    - ~Buy: €50, Sell: €44~

  - Crate of Human Souls

    - ~Buy: €63, Sell: €60~

  - Bolts of Spider-Silk

    - ~Buy: €100, Sell: €50~

  - Bale of Parabola-Linen

    - ~Buy: €120, Sell: €60~

- *Carrow's Naval Surplus*

  Mr. Carrow has found a use for the equipment once sold to the sadly reduced Royal Navy.

  - Torpedo Components

    - ~Buy: €5, Sell: €1~

  - Leadbeater & Stainrod Reconditioned Frigate-Surplus Deck-Gun Mark II

    - ~Buy: €50, Sell: €10~

  - Torpedo Nets

    - ~Buy: €100, Sell: €10~

  - Leadbeater & Stainrod 'Seaworm'

    - ~Buy: €100, Sell: €50~

  - Cotterell & Hathersage 'Reproach'

    - ~Buy: €200, Sell: €100~

  - Leadbeater & Stainrod 'Britomart' Flensing-Cannon

    - ~Buy: €200, Sell: €100~

  - Leadbeater & Stainrod 'Winnower'

    - ~Buy: €300, Sell: €150~

  - Leadbeater & Stainrod 'Scorpion'

    - ~Buy: €300, Sell: €150~

  - Cotterell & Hathersage 'Majesty'

    - ~Buy: €300, Sell: €150~

  - Stampshod's 'Calvary' Prong Launcher

    - ~Buy: €500, Sell: €250~

  - Cotterell & Hathersage 'Denunciation'

    - ~Buy: €500, Sell: €250~

  - Cotterell & Hathersage Pneumatic Dynamite Torpedo-Gun

    - ~Buy: €600, Sell: €300~

  - Cotterell & Hathersage 'Discouragement'

    - ~Buy: €600, Sell: €300~

- *Caminus Yards*

  The dangerously jovial Mr. Fires manufactures the most intimidating, least carefully tested devices.

  - WE ARE CLAY

    - ~Buy: NaN, Sell: €300~

  - Rattus Faber Assistant

    - ~Buy: €100, Sell: €0~

  - Caminus Yards 'Bandersnatch'

    - ~Buy: €600, Sell: €300~

  - Caminus Yards Avid Suppressor

    - ~Buy: €800, Sell: €450~

  - Caminus Yards Hellthrasher

    - ~Buy: €900, Sell: €450~

  - Caminus Yards Heart-Ender

    - ~Buy: €900, Sell: €450~

  - Caminus Yards 'D _ nation'

    - ~Buy: €900, Sell: €450~

  - Caminus Yards 'Compulsion'

    - ~Buy: €5000, Sell: €0~

- *The Iron and Misery Company*

  [More powerful engines consume more fuel, but increase speed - essential for large slow ships.]

  - The Serpentine

    - ~Buy: NaN, Sell: €500~

  - Elderly Steeple-Engine

    - ~Buy: €50, Sell: €10~

  - Leadbeater & Stainrod 'Illyrian'

    - ~Buy: €500, Sell: €250~

  - Secure Compartment

    - ~Buy: €500, Sell: €250~

  - Leadbeater & Stainrod 'Boadicea'

    - ~Buy: €1000, Sell: €500~

  - Cotterell & Hathersage 'Manticore No. 4'

    - ~Buy: €2000, Sell: €1000~

  - Cotterell & Hathersage 'Admiralty Special'

    - ~Buy: €4000, Sell: €2500~

- *Bultitude's House of Vision*

  Bultitude's political convicitions may be suspect, but his ship's lights are reliably excellent.

  - Whithern Optical

    - ~Buy: €100, Sell: €50~

  - Soft Glim-Lamp

    - ~Buy: €500, Sell: €100~

  - Blazing Glim-Lamp

    - ~Buy: €1000, Sell: €200~

  - Montaigne Projector

    - ~Buy: €4000, Sell: €400~

  - Speculative Consonator

    - ~Buy: €4000, Sell: €400~

  - Judgement Resonator

    - ~Buy: €6000, Sell: €600~

* Light-Ship

Far from home.

Its clear bright beam warms the way. 

* Pigmote Isle

Two houses, both alike in dignity.

