examples/SunlessSea/Captain II.html

<div id="outline-container-orgebf5b6e" class="outline-3">
<h3 id="orgebf5b6e">Your Comatose Ferret</h3>
<div class="outline-text-3" id="text-orgebf5b6e">
<ul class="org-ul">
<li><code>Comatose Ferret (Mascot)</code></li>
</ul>

<p>
Mostly, it's immobile. Occasionally, it's feral.
</p>

<p>
It lies across the deck like a lumpy scarf.
</p>

<ul class="org-ul">
<li><code>Play with your Ferret</code></li>
</ul>

<p>
Attract its attention.
</p>

<p>
<b>A weary roll of the eye</b>
</p>

<p>
Play, that eye-roll says. Play. I played once, in the happy warrens of London, before you installed me in this floating coffin and made me eat dried food. Damn your play. It is an eloquent eye-roll.
</p>
</div>
</div>

<div id="outline-container-org07d5109" class="outline-3">
<h3 id="org07d5109">Your Blemmigan Gallivanter</h3>
<div class="outline-text-3" id="text-org07d5109">
<p>
It has made its home on a shelf in your cabin. It has built a nest from loose journal pages, the engineer's scarf and a possibily pilfered map.
</p>

<ul class="org-ul">
<li><code>Entertain your Blemmigan</code></li>
</ul>

<p>
You can see the indentation of a porthole on the rim of its cap. It must have been pressing its face to the windows again. Is it bored?
</p>

<p>
<b>A ticklish thing</b>
</p>

<p>
The Blemmigan flails and squirms as you tickle it. Its high-pitched warble is almost certainly giggling. When you stop - to check that you're not actually hurting it - it warps its tendrils around your fingers and pulls your hand back. Apparently it is enjoying itself. 
</p>
</div>
</div>

<div id="outline-container-org0e1ecbf" class="outline-3">
<h3 id="org0e1ecbf">Speak to the Longshanks Gunner</h3>
<div class="outline-text-3" id="text-org0e1ecbf">
<p>
"Orright, Captain. What do yer want me to shoot at now?"
</p>

<ul class="org-ul">
<li><code>Ask what she wants from life</code></li>
</ul>

<p>
Why did she come to zee?
</p>

<p>
<b>"Khan's Shadow"</b>
</p>

<p>
"It's like the Flit at zee, right? No one to tell yer what to say or do. And no one to kick yer downstairs just 'cos yer got a little bit tall. I'll be a faithful officer, but put me ashore at the Shadow, and I won't forget yer."
</p>
</div>
</div>

<div id="outline-container-org6946cdd" class="outline-3">
<h3 id="org6946cdd">Shops</h3>
<div class="outline-text-3" id="text-org6946cdd">
<p>
Cargoes, treasures, weapons, secrets. Mischief.
</p>

<ul class="org-ul">
<li><p>
<b>Mrs. Plenty's Shipside Privisioners</b>
</p>

<p>
A profitable sideline for the notorious carnival entrepreneuse.
</p>

<ul class="org-ul">
<li>Solacefruit

<ul class="org-ul">
<li><code>Buy: NaN, Sell: €50</code></li>
</ul></li>

<li>Fuel

<ul class="org-ul">
<li><code>Buy: €10, Sell: €2</code></li>
</ul></li>

<li>Flare

<ul class="org-ul">
<li><code>Buy: €10, Sell: €0</code></li>
</ul></li>

<li>Supplies

<ul class="org-ul">
<li><code>Buy: €20, Sell: €5</code></li>
</ul></li>

<li>Foxfire Candles

<ul class="org-ul">
<li><code>Buy: €40, Sell: €20</code></li>
</ul></li>
</ul></li>

<li><p>
<b>WolfStack Exchange</b>
</p>

<p>
Trading in common goods will only earn slim profits. Seek other opportunities.
</p>

<ul class="org-ul">
<li>Scintillack

<ul class="org-ul">
<li><code>Buy: NaN, Sell: €70</code></li>
</ul></li>

<li>Devilbone Dice

<ul class="org-ul">
<li><code>Buy: NaN, Sell: €20</code></li>
</ul></li>

<li>Mutersalt

<ul class="org-ul">
<li><code>Buy: NaN, Sell: €50</code></li>
</ul></li>

<li>Zzoup

<ul class="org-ul">
<li><code>Buy: NaN, Sell: €70</code></li>
</ul></li>

<li>Solacefruit

<ul class="org-ul">
<li><code>Buy: NaN, Sell: €50</code></li>
</ul></li>

<li>A Casket of Sapphires

<ul class="org-ul">
<li><code>Buy: NaN, Sell: €90</code></li>
</ul></li>

<li>Stygian Ivory

<ul class="org-ul">
<li><code>Buy: NaN, Sell: €28</code></li>
</ul></li>

<li>Royal-blue Feather

<ul class="org-ul">
<li><code>Buy: NaN, Sell: €1</code></li>
</ul></li>

<li>Approved Romantic Literature

<ul class="org-ul">
<li><code>Buy: NaN, Sell: €22</code></li>
</ul></li>

<li>Cask of Mushroom Wine

<ul class="org-ul">
<li><code>Buy: €21, Sell: €20</code></li>
</ul></li>

<li>Firkin of Prisoner's Honey

<ul class="org-ul">
<li><code>Buy: €25, Sell: €20</code></li>
</ul></li>

<li>Sack of Darkdrop Coffee Beans

<ul class="org-ul">
<li><code>Buy: €50, Sell: €44</code></li>
</ul></li>

<li>Crate of Human Souls

<ul class="org-ul">
<li><code>Buy: €63, Sell: €60</code></li>
</ul></li>

<li>Bolts of Spider-Silk

<ul class="org-ul">
<li><code>Buy: €100, Sell: €50</code></li>
</ul></li>

<li>Bale of Parabola-Linen

<ul class="org-ul">
<li><code>Buy: €120, Sell: €60</code></li>
</ul></li>
</ul></li>

<li><p>
<b>Carrow's Naval Surplus</b>
</p>

<p>
Mr. Carrow has found a use for the equipment once sold to the sadly reduced Royal Navy.
</p>

<ul class="org-ul">
<li>Torpedo Components

<ul class="org-ul">
<li><code>Buy: €5, Sell: €1</code></li>
</ul></li>

<li>Leadbeater &amp; Stainrod Reconditioned Frigate-Surplus Deck-Gun Mark II

<ul class="org-ul">
<li><code>Buy: €50, Sell: €10</code></li>
</ul></li>

<li>Torpedo Nets

<ul class="org-ul">
<li><code>Buy: €100, Sell: €10</code></li>
</ul></li>

<li>Leadbeater &amp; Stainrod 'Seaworm'

<ul class="org-ul">
<li><code>Buy: €100, Sell: €50</code></li>
</ul></li>

<li>Cotterell &amp; Hathersage 'Reproach'

<ul class="org-ul">
<li><code>Buy: €200, Sell: €100</code></li>
</ul></li>

<li>Leadbeater &amp; Stainrod 'Britomart' Flensing-Cannon

<ul class="org-ul">
<li><code>Buy: €200, Sell: €100</code></li>
</ul></li>

<li>Leadbeater &amp; Stainrod 'Winnower'

<ul class="org-ul">
<li><code>Buy: €300, Sell: €150</code></li>
</ul></li>

<li>Leadbeater &amp; Stainrod 'Scorpion'

<ul class="org-ul">
<li><code>Buy: €300, Sell: €150</code></li>
</ul></li>

<li>Cotterell &amp; Hathersage 'Majesty'

<ul class="org-ul">
<li><code>Buy: €300, Sell: €150</code></li>
</ul></li>

<li>Stampshod's 'Calvary' Prong Launcher

<ul class="org-ul">
<li><code>Buy: €500, Sell: €250</code></li>
</ul></li>

<li>Cotterell &amp; Hathersage 'Denunciation'

<ul class="org-ul">
<li><code>Buy: €500, Sell: €250</code></li>
</ul></li>

<li>Cotterell &amp; Hathersage Pneumatic Dynamite Torpedo-Gun

<ul class="org-ul">
<li><code>Buy: €600, Sell: €300</code></li>
</ul></li>

<li>Cotterell &amp; Hathersage 'Discouragement'

<ul class="org-ul">
<li><code>Buy: €600, Sell: €300</code></li>
</ul></li>
</ul></li>

<li><p>
<b>Caminus Yards</b>
</p>

<p>
The dangerously jovial Mr. Fires manufactures the most intimidating, least carefully tested devices.
</p>

<ul class="org-ul">
<li>WE ARE CLAY

<ul class="org-ul">
<li><code>Buy: NaN, Sell: €300</code></li>
</ul></li>

<li>Rattus Faber Assistant

<ul class="org-ul">
<li><code>Buy: €100, Sell: €0</code></li>
</ul></li>

<li>Caminus Yards 'Bandersnatch'

<ul class="org-ul">
<li><code>Buy: €600, Sell: €300</code></li>
</ul></li>

<li>Caminus Yards Avid Suppressor

<ul class="org-ul">
<li><code>Buy: €800, Sell: €450</code></li>
</ul></li>

<li>Caminus Yards Hellthrasher

<ul class="org-ul">
<li><code>Buy: €900, Sell: €450</code></li>
</ul></li>

<li>Caminus Yards Heart-Ender

<ul class="org-ul">
<li><code>Buy: €900, Sell: €450</code></li>
</ul></li>

<li>Caminus Yards 'D _ nation'

<ul class="org-ul">
<li><code>Buy: €900, Sell: €450</code></li>
</ul></li>

<li>Caminus Yards 'Compulsion'

<ul class="org-ul">
<li><code>Buy: €5000, Sell: €0</code></li>
</ul></li>
</ul></li>

<li><p>
<b>The Iron and Misery Company</b>
</p>

<p>
[More powerful engines consume more fuel, but increase speed - essential for large slow ships.]
</p>

<ul class="org-ul">
<li>The Serpentine

<ul class="org-ul">
<li><code>Buy: NaN, Sell: €500</code></li>
</ul></li>

<li>Elderly Steeple-Engine

<ul class="org-ul">
<li><code>Buy: €50, Sell: €10</code></li>
</ul></li>

<li>Leadbeater &amp; Stainrod 'Illyrian'

<ul class="org-ul">
<li><code>Buy: €500, Sell: €250</code></li>
</ul></li>

<li>Secure Compartment

<ul class="org-ul">
<li><code>Buy: €500, Sell: €250</code></li>
</ul></li>

<li>Leadbeater &amp; Stainrod 'Boadicea'

<ul class="org-ul">
<li><code>Buy: €1000, Sell: €500</code></li>
</ul></li>

<li>Cotterell &amp; Hathersage 'Manticore No. 4'

<ul class="org-ul">
<li><code>Buy: €2000, Sell: €1000</code></li>
</ul></li>

<li>Cotterell &amp; Hathersage 'Admiralty Special'

<ul class="org-ul">
<li><code>Buy: €4000, Sell: €2500</code></li>
</ul></li>
</ul></li>

<li><p>
<b>Bultitude's House of Vision</b>
</p>

<p>
Bultitude's political convicitions may be suspect, but his ship's lights are reliably excellent.
</p>

<ul class="org-ul">
<li>Whithern Optical

<ul class="org-ul">
<li><code>Buy: €100, Sell: €50</code></li>
</ul></li>

<li>Soft Glim-Lamp

<ul class="org-ul">
<li><code>Buy: €500, Sell: €100</code></li>
</ul></li>

<li>Blazing Glim-Lamp

<ul class="org-ul">
<li><code>Buy: €1000, Sell: €200</code></li>
</ul></li>

<li>Montaigne Projector

<ul class="org-ul">
<li><code>Buy: €4000, Sell: €400</code></li>
</ul></li>

<li>Speculative Consonator

<ul class="org-ul">
<li><code>Buy: €4000, Sell: €400</code></li>
</ul></li>

<li>Judgement Resonator

<ul class="org-ul">
<li><code>Buy: €6000, Sell: €600</code></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfc96a66" class="outline-2">
<h2 id="orgfc96a66">Light-Ship</h2>
<div class="outline-text-2" id="text-orgfc96a66">
<p>
Far from home.
</p>

<p>
Its clear bright beam warms the way. 
</p>
</div>
</div>

<div id="outline-container-org7c9fee6" class="outline-2">
<h2 id="org7c9fee6">Pigmote Isle</h2>
<div class="outline-text-2" id="text-org7c9fee6">
<p>
Two houses, both alike in dignity.
</p>
</div>
