examples/SunlessSea/Captain II.html

<div id="outline-container-orgec96a60" class="outline-3">
<h3 id="orgec96a60">On A Lonely Desert Beach</h3>
<div class="outline-text-3" id="text-orgec96a60">
<p>
There is no habitation in sight, no market, only an old, rotting dock. A stretch of sand thickens to damp, black earth, from which sprout stunted&#x2026; Palms? Not quite: tall fungal growths with frond-like caps, as if someone has sculpted the idea of a tree from a mushroom.
</p>

<ul class="org-ul">
<li><code>Disembark</code></li>
</ul>

<p>
See what awaits you.
</p>

<p>
<b>War?</b>
</p>

<p>
As you step on to the quay, you hear clamour, shouts, and shooting; you can see, off in the distance, smoke rising from beyond the hill, and dots of fire flecking the horizon. Two tiny figures stand a little further down the quay. Unmoving. As if awaiting your approach.
</p>
</div>
</div>
