examples/SunlessSea/Captain II.org
** A Literary Interlude

The following is an extract from the popular /Diary Of A Zee-Captain: From London To Irem And What We Did There Before We Arrived/, washed ashore on Mutton Island, and subsequently serialised in the Unexpurgated Gazette. The author's identity remains unknown.

- ~The Tale of Pigmote Isle~

In which a delegation is made, a choice is presented, war is declared, a most singular treasure is sought by all, and a new empire is founded with tooth and claw.

*Chapter I: The Delegation*

/The figures were rodents! To my left was a Rattus Faber, wearing goggles, a blacksmith's apron, and an assortment of tools; to my right an unusually large guinea pig, wearing helmet and breastplate reminiscent of nothing so much as the High Middle Ages./

/The rat stepped forward first and bowed./

/"Welcome, Captain, to Rat Star Island. I am Edgar, Second Chief Engineer of the Third Rat Brigade. I invite you to avail yourself of food and fuel at our expense; the only cost to you is a choice."/

/The rat stepped back; at precisely the same moment, with what appeared to be the ease of long habit, the guinea pig scuttled forward, and made a declamatory chirp./

/"Welcom, Captain, to the Isle of Cavia. I am Lady Augusta Devereaux Swinch of the Blackwater Swinches, Seneschal to our King Gracegnaw, First of His Name. I invite you to avail yourself of food and fuel at our expense; the only cost to you is a choice."/

/The two stood at attention, looking at me expectantly./

*Chapter II: Alike In Dignity*

/The two remarkable rodents sat... squatted... both seeking my support. I knew I had to choose carefully./

- ~I spoke to the Chief-Engineer~

His eyes had a wave-cold glint on them and he wore his scars like jewels.

*A Rat in the Making*

/I asked the Chief Engineer to elaborate. He looked at me for a long, measured moment before speaking gruffly./

/"We came to this island to make a home for ourselves from London, its cats and Snuffers, Rat-Skin Suits. We came to live as citizens of our own Republic! We came with our tools, our teeth, our clever hands, and made a beautiful city by the light of the Rat Star that shone bright and blue on Mount Ararat." The Chief Engineer nodded towards the distant hill./

/"One day we braved the depths of the Chickenwoods, and from the top of Mount Ararat we plucked Rat Star to be our light, our beacon. But the Pigs of Cavy saw the light, and they lusted for it; they send armies to rule us and steal our Star! We will not permit them to take what is ours! We will resist to last of our breath! Will you join us to defeating them?"/

- ~I spoke to the Seneschal~

How did an armoured guinea pig manage to look regal?

*A Knight out of Habit*

/The Seneschal cleared her throat with a delicacy to rival the Duchess' own before speaking./

/"Gracegnaw the King, our Lord and our Sovereign,/

/Full seven months had sojourned on the sea,/

/Conquered this land, and won the Southern main,/

/Now no fortress against him shall remain,/

/No city walls left for him to gain,/

/Save the RATS! That squeak behind mountain!/

/Unlikely was the Lamb of our deliverance,/

/Assured shall be our glories and their fall,/

/When Our Lady's Eye resotred to be our hall!"/

/The Seneschal composed herself, then added, "We saw truth and beauty by the light of Our Lady's Eye on Mount Cavyat. But the rats, with their guns and chatters and their peasants' politics, stole it from us. We will subjugate them and take it back. They are a rabble, and we will rule them with the steel-shod velvet of our paws. Will you join us?"/

- ~I had heard more than enough~

I was ready to make my choice.

/As you can well imagine. I faced quite a dilemma. Their red eyes started up at me, waiting for my choice./

- ~I sided with the Chief Engineer~

He seemed grumpy but honest. Also, I knew all too well that rat-made weapons can do.

*A friend to rats*

/I extended a finger to the Chief Engineer, who shook it grimly. The Seneschal hissed and chatter her teeth in disgust, but kept her distance./

/"You've made the right choice," said the Chief Engineer. "Let me show you around."/

*Chapter III: A Rat In The Making*

/The Chief Engineer led me to the northern side of this island, skirting the Chickenwoods. We passed through a number of what can only be termed check-points, as fierce-eyed rats shouldered their derringers and saluted to the Chief Engineer. Soon we come upon a small colony, smaller than some of the infestations I had encountered in London flats: perhaps only fifty Rattus Faber all together, working diligently to fortify their side of the island./

/The first thing I noticed was a brilliant light, beaming out from a stump of Chickenwood about six feet high; it bathed the whole settlement in a clean blue glow, and was almost too bright to look at. By its light, I could see several raised mounds of earth, suggesting shallow tunnels./

/An efficient fishing operation was set up by the water: an albino rat mending nets while others stabbed sharpened sticks into the waves. Further inland was a barracks, where a sergeant barked drills at a small squadron of fighters./

/My arrival drew attention, and several rats paused in their work to look at me curiously./

/"Welcome to Murinia," said the Chief Engineer, voice warm with pride. "It's not much to look at now, but it will be once we've rousted the cavies. Take a stroll around while I summon the war council."/

/With that he vanished into one of the mounds and left me to explore./

- ~I visited the rats' barracks~

The dirll sergeant appeared to be sizing me up. Were the few rats around her really all she had to launch an attack?

*We were fighting impressive odds*

/I approached the drill sergeant and went so far as to salute her, which earned me a grunt of satisfaction. The sergeant dismissed her troops and offered me a bit of Chickenwood jerky to gnaw on./

/"There's more of us below ground," she explained, "but not enough. The cavies are bigger and there's more of 'em. We're better with weapons, but haven't got the stuff to make 'em with. Most of us came here as stowaways, brought nothing but food, tools, and the fur on our backs. We can fish, and we nibble the Chickenwoods, but we can't make guns out of trees. The cavies came here with their own steamer, and seem to have endless supplies - We raid 'em, sometimes, but there's so few of us, and we can never hold on to territory gained for long. But that's of no consequence - all we want is to be left in peace to build our Republic. And the Rat Star," she added thoughtfully, after a moment, "Of course, we want that too."/

- ~I took a closer look at the 'Rat Star'~

An excitable-looking rat was peering at it through smoky goggles, twitching her whiskers and making notes on what appeared to be real paper.

*Blue as a sapphire, but endlessly more brilliant.*

/"It's not a star, of course, not really, but try explaining that to the others. The Chief Engineer doesn't want me working too hard to convince them - says this is better for morale - but just look at it! Look!"/

/She offered me her goggles: I managed to work them over just enough of one of my eyes to see the truth of what she was studying./

/It was scintillack! But unlike any I'd seen before: blue as a sapphire, but more brilliant. Something about the clarity of is colour was tremendously soothing. The Chief Science Officer tittered with pleasure as I handed her goggles back./

/"Those of us who've been to the Cavy side of this island and lived to tell it say that there's plenty of glow there, plenty of bright in the water all round, but nothing like this. We took this from the island's centre, Mount Ararat - only it's not a mountain, of course, any more than this is a star! It's hollow - there's sweet water inside, and coral crawling all up to the walls of it. But nothing that glows, save this. It's ours now and no one can take it from us!"/

- ~I headed down to the beach~

Who ever heard of a rat /mending/ a net?

*Where the green billows played*

/An albino rat smiled up at me from his mending work, looking dainty and a little shy./

/"Chicekwood floats, especially when it's dried out and sealed, so we're able to paddle out a bit and cast our nets. We come up with all sort of things: blindfish, crabs, sometimes a chunk of broken tentacle. But the fishing would never be so good without the Rat Star." He beamed. "I think it only draws good fish, and keeps the scary ones at bay. I know the Chief Science Officer doesn't believe it, but I do. That light is our livelihood."/

- ~I finished my exploration~

The bells of the War Council rang. I was summoned.

*Chapter IV: A Vital Enterprise*

/The Chief Engineer emerged from underground with a motley assortment of other rats: he introduced them as weapons experts, strategiests, and field commanders./

/"So you're going to help us beat the Cavies," he said, a hard edge to his voice. "But how exactly?"/

- ~I offered my strategic assistance~

We engineered a distraction, that the L.B.s could use to plunder the Cavy's ship and turn the tide in their favour.

*A Questing Beast*

/I dressed up one of my zailors in a mess of shabby cloth smeared with prisoner's honey, and instructed him to roll around in the black earth of the island. Soon we had a glorious mud monster to send thrashing trhough the Chicekwoods towards the Cavies./

/The distraction worked perfectly; the Cavies diverted their force towards our makeshift beast, leaving the rats iwth very little opposition as they plundered the grounded ship./

/They returned triumphant - as did my sailor, laughing, having led the Cavies a merry chase. With a few hours the rats' diligence had resulted in a building of a remarkable cache of wepaons with which they successfully routed their enemy./

/The rats, ever egalitarian, shared their spoils in addition to the promised food and fuel./

*Chapter V: A Nation Is Born*

/The house of Cavy had fallen. Murinia was triumphant. All that remained were the celebrations, and the continuation of our vayage. Oh, how we feasted long into the night. Then.../

- ~I invited one of the Rattus Faber to join us~

After all, what's a ship without a few rats?

/The Chief Engineer couldn't leave his colony, but he relayed my quest to his people. The Albino rat I saw mending nets shyly stepped forward./

/"I'm good at fixing things," he said, earnestly, "and I'd like to see more of this world."/

/I waited him to gather up some effects and say goodbye to his family before accompanying him on board./

- ~I interceded on behalf of the cavies~

They were crashed, defeated, and I could see their spirits broken without the light of the Rat Star to guide them. They needed an advocate.

*A grudging concession*

- ~The wide dark zee beckoned~

We had eaten our fill and our business was concluded. It was time to continue our vayage and see what wonders and terrors still awaited us.

*THE END*

There. You finished your diary entry, and the final dregs of he rats' surprisingly good wine. They line up to salute you as you leave the victory banquet, and escorting you to your ship through the foundations of the their new Republic.

