examples/SunlessSea/Captain II.html

<div id="outline-container-org1349bac" class="outline-3">
<h3 id="org1349bac">The Rise of Pigmote Isle</h3>
<div class="outline-text-3" id="text-org1349bac">
<p>
Hail Murinia! The Neath's most adorable nation scurries around your legs. Scintillack harvesters drag heavy bags of the island's bounty to their silos. Industrious rodents work hard on towering edifices, some of them are almost neck-high. (London will never belive a b _ dy word of this.)
</p>
</div>
</div>
</div>

<div id="outline-container-orge329b7c" class="outline-2">
<h2 id="orge329b7c">BATTLE RESULT I</h2>
<div class="outline-text-2" id="text-orge329b7c">
</div>
<div id="outline-container-org7af0a48" class="outline-3">
<h3 id="org7af0a48">You've Destroyed a Rat-Barge</h3>
<div class="outline-text-3" id="text-org7af0a48">
<p>
The ship is yours! What will you do with her?
</p>

<ul class="org-ul">
<li><code>Loot and sculttle her</code></li>
</ul>

<p>
She's a vile old vessel, and these zees aren't safe. Take what you can and move on.
</p>

<p>
<b>Lean pickings</b>
</p>

<p>
These pinnaces don't sail far from their hidden harbours, but here's something at the back of the hold.
</p>
</div>
</div>

<div id="outline-container-org9327988" class="outline-3">
<h3 id="org9327988">Opening a Cache of Curiosities</h3>
<div class="outline-text-3" id="text-org9327988">
<p>
What's inside?
</p>

<ul class="org-ul">
<li><code>A stout crate</code></li>
</ul>

<p>
Crates! The source of sustenance: the fundamental element of cargo.
</p>

<p>
<b>A crate of fuel</b>
</p>

<p>
Coke! Like coal, but more so, as the Department of Infernal Rarefactions would have it.
</p>
</div>
</div>
</div>

<div id="outline-container-org4140ff3" class="outline-2">
<h2 id="org4140ff3">Port Carnelian</h2>
<div class="outline-text-2" id="text-org4140ff3">
<p>
Fallen London's sole Imperial possession. Treasure it.
</p>

<ul class="org-ul">
<li><code>Port Carnelian</code></li>
</ul>

<p>
London's first Underzee colony sweats under a blanket of sourthern heat. To the right of the dock, the sapphire-mines yawn. To the right, the Governor's house stands, prim as an Elderwick's mansion. Behind lies the fungal jungle, ghostly in white and violet.
</p>

<ul class="org-ul">
<li><code>Call a Heartscroos House</code></li>
</ul>

<p>
Where the Governor administers this distant fleck of Her Majesty's empire.
</p>

<p>
<b>A port report</b>
</p>

<p>
The Governor is very, very busy. An attache offers you a bowl of sugared puffballs, and explains the work the Governor does among these natives. "Got to keep them happy, what? After all, they <i>are</i> tigers."
</p>
</div>

<div id="outline-container-org334343c" class="outline-3">
<h3 id="org334343c">Zubmariner: the Fierce Philanthropist</h3>
<div class="outline-text-3" id="text-org334343c">
<p>
Her house is built in the tall, porticoed London style. Red brick and white plaster. Decorative iron railings, painted black.
</p>

<p>
Its mistress is the subject of intense colonial gossip: independently wealthy, an industrialist's daughter, a widow, unwelcome in London&#x2026; What, then, does she want with you? An invitation, arrived as soon as you docked.
</p>

<ul class="org-ul">
<li><code>Accept her invitation</code></li>
</ul>

<p>
It woundn't hurt to have the backing of a wealthy benefactor.
</p>

<p>
You expected a sizable gather, but it's just you, her, and a decanter of admirable sherry. She is not a small woman, and comprehensively occupies her armchair. Her hair is impeccably curled.
</p>

<p>
"I've heard a number of shocking things about you, Captain, all of which I consider thoroughly promising." Her accent has a hint of Midlands melancholy to it. She must have spent musch of her life on the Surface.
</p>

<p>
For a time, she asks questions about your travels and listen avidly to your answers. Then she gets down to business.
</p>
</div>
</div>

<div id="outline-container-org9d5f976" class="outline-3">
<h3 id="org9d5f976">Sherry with the Fierce Philanthropist</h3>
<div class="outline-text-3" id="text-org9d5f976">
<p>
"A question, Captain." She tops up her sherry. "Some years ago, the nations of the Neath struck an agreement to abandon their research into zubmarine travels, and leave the zee depths untouched."
</p>

<p>
Ah, the <i>Agreement About Noghing of Consequence</i>. Zailors mutter about it while listing the Admiralty's follies. You nod.
</p>

<p>
She raises her glass to her lips. "And what is your opnion about this agreement?" She asks.
</p>

<ul class="org-ul">
<li><code>Scoff about it</code></li>
</ul>

<p>
It's a nonsense! Nowhere should be forbidden to a capable explorer!
</p>

<p>
<b>A new friend</b>
</p>

<p>
Her smile is conspiratorial. "Then we can help each other. I am prepared to finance - in a large part - improvements to your ship that will make it capable of zubmarine travel."
</p>

<p>
"The Admiralty - ad other powers - disapprove of such innovation. Therefore, we need to be discreet. I have procured experts, labourers, and a workshop. They are well-paid, and loyal. Here is the address. Meet us there, and we will begin our work."
</p>
</div>
</div>

<div id="outline-container-org9b3d495" class="outline-3">
<h3 id="org9b3d495">The Hidden Workshop</h3>
<div class="outline-text-3" id="text-org9b3d495">
<p>
On the shore of a gloomy inlet stands a rickety factory. Once - and supposedly still - it was committed to the cutting and polishing of sapphires.
</p>

<p>
Now it is the place where the Fierce Philanthropist houses her intrepid staff of engineers: the ingenious men and women who will convert your ship into a zubmarine.
</p>

<ul class="org-ul">
<li><code>Leave the workshop</code></li>
</ul>

<p>
Its noise. Its arguments. Its overwhelming smell of oil and peppermints.
</p>

<p>
<b>You close the door behind you</b>
</p>

<p>
Back to Port Carnelian: the hubbub, the pungent scent of the fungal jungle, the low rumble as tigers pad by on the street.
</p>
</div>
</div>

<div id="outline-container-orga5a6f18" class="outline-3">
<h3 id="orga5a6f18">Shops</h3>
<div class="outline-text-3" id="text-orga5a6f18">
<p>
Not just sapphires. Although there are quite a lot of sapphires.
</p>

<ul class="org-ul">
<li><p>
<b>Dockside Market</b>
</p>

<p>
The stalls are almost the same as Wolfstack. So are the sounds. The scents are utterly different.
</p>

<ul class="org-ul">
<li>Fuel

<ul class="org-ul">
<li><code>Buy: €12, Sell: €0</code></li>
</ul></li>

<li>Supplies

<ul class="org-ul">
<li><code>Buy: €18, Sell: €0</code></li>
</ul></li>

<li>Solacefruit

<ul class="org-ul">
<li><code>Buy: €250, Sell: €50</code></li>
</ul></li>
</ul></li>

<li><p>
<b>Sapphire Exchange</b>
</p>

<p>
Actually, this place is indeed mostly sapphires.
</p>

<ul class="org-ul">
<li>Romantic Literature

<ul class="org-ul">
<li><code>Buy: €0, Sell: €22</code></li>
</ul></li>

<li>Cask of Mushroom Wine

<ul class="org-ul">
<li><code>Buy: €0, Sell: €23</code></li>
</ul></li>

<li>Sack of Darkdrop Coffee Bean

<ul class="org-ul">
<li><code>Buy: €38, Sell: €0</code></li>
</ul></li>

<li>A Casket of Sapphires

<ul class="org-ul">
<li><code>Buy: €86, Sell: €0</code></li>
</ul></li>

<li>Mountain-sherd

<ul class="org-ul">
<li><code>Buy: €2000, Sell: €0</code></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbcb958b" class="outline-2">
<h2 id="orgbcb958b">Grand Geode</h2>
<div class="outline-text-2" id="text-orgbcb958b">
<p>
A distant song like a mirage.
</p>

<p>
A naval base, with the Royal Navy's emblems, cruiously amended. Efficient, bright-eyed men and women work briskly, everywhere you look. They are singing: hymns with unfamiliar words. Hard-faced Royal Marines watch you carefully, barring entry to the Geode's heart.
</p>

<p>
A plaque by the dock has been defaced with orange paint, but you can still make out the original inscriptions: 'STATION V (ADJUNCT)'.
</p>

<ul class="org-ul">
<li><code>Compile a Port Report</code></li>
</ul>

<p>
Does the Admiralty know? Or want to know?
</p>

<p>
<b>Take discreet notes</b>
</p>

<p>
THe Marines are watching.
</p>

<ul class="org-ul">
<li><code>Ask to speak with someone in authority</code></li>
</ul>

<p>
What is this place?
</p>

<p>
<b>"The Commodore may be able to give you a few minutes -"</b>
</p>

<p>
The commodore shakes your hand warmly. He's a handsome, open-faced fellow in an immaculate Navy uniform. His office is equally handsome. It overlooks the glittering interior crystal cliff - it must be as well lit as any study in the Neath. He deflects questions about the purpose of this installation - "classified, you know." - but smilingly offers you tea, biscuits and mineralogical anecdotes.
</p>

<p>
The biscuits are good, but the anecdotes rather blend one into the next. You find yourself nodding, and then jerk suddenly awake. The Commodore is smiling. Your cup is empty. You fell well, very well. A little euphoric, even. "Come back soon," he says softly.
</p>

<ul class="org-ul">
<li><code>Engage an Officier: the Carnelian Exile</code></li>
</ul>

<p>
A dark-spectacled woman marches up to you, in some haste. "Captain. Take me with you. I am no longer welcome here&#x2026; and I will show you where we need to go." 
</p>

<p>
<b>Welcom aboard!</b>
</p>

<p>
"Here I am. A ship, I suppose, is both always here, and never there, because there becomes here."  
</p>
</div>
</div>
