examples/SunlessSea/Captain II.org
* FIRE!

You've pushed your engines too far, too fast! Zailors scream - flames rage -

- ~Heal the wounded, damp the flames~

Do what you can -

*Bandaging the wounded*

You've saved injured zailors. But the ship has suffered terribly -

* BATTLE RESULT II

** You've Destroyed The Unfinished Revolutionaries

Fragements of clay litter acroos the deck. They crunch underfoot like postherds. Unfinished men do not surrender.

- ~Investigate the hold~

What treasure did these villains take?

** Opening A  Cache Of Curiosities 

What's inside?

- ~A stout crate~

Crates! The source of sustenance: the fundamental element of cargo.

*A crate of fuel*

Coke! Like coal, but more so, as the Department of Infernal Rarefactions would have it.

* A White Zee-Bat

A zailor has grown fretful and disobedient, reluctant to go on deck, even in port. "There's a white zee-bat watching me up there. Salt's messenger. Salt's got its eye on me. I'll never see home again."

- ~Salt~

One of the nameless god that zailors fear. This zailor is a conscientious man. Sen him to the sick bay on the pretext of a fever.

*And onwards*

The zailor is grateful, though your ship's doctor rolls a sceptical eye. When he next goes up on deck, the railings are clear of zee-bats, white or black, and he sets to work with a will. 

* Cumaean Canal Staging Area

Here, the dark waters run down from the surface, from a brighter sea... 

The Canal ascends, through locks and gates and shadowed turns, to the sunlight of the Surface.

- ~Gather information for a Port Report~

Many ships pass this way, but perhaps you will pick up something they missed.

*Bussiness as usual*

The gates open and shuts. The locks remain free from sabotage. If anywhere besides London is safe in all the Underzee, it's here. The Surface nations have an interest in keeping the way open.

- ~Listen for Surface gossip~

The ships of Surface linger here: this is their life-line to a warmer place.

*A sorry end*

A card game ends badly when one Surface sailor knifes other for all the usual reasons. The other players scrabble for the coins spill from her pockets, but you snatch up a scrap of paper they overlook. Curious markings: dates, times, code-names. Spy's work?

** Shops

- *Harbour Provisioners*

  A sluggish and hostile merchant squints warily. A few goods of indifferently quality are available.

  - Fuel
    
    - ~Buy: €20, Sell: €1~

  - Supplies

    - ~Buy: €30, Sell: €5~

* Sailing Logbook

- /January 5th, 1888/: Discovered The Echo Bazaar!
- /January 5th, 1888/: Discovered Dept. of Menace Eradication!
- /January 6th, 1888/: A zailor is praying.
- /January 6th, 1888/: Discovered Badstevener's Abyss!
- /January 6th, 1888/: Discovered Rowena's Rocks!
- /January 6th, 1888/: Discovered Moody's Light!
- /January 6th, 1888/: Discovered Purewal Point!
- /January 6th, 1888/: Here the wilder airs mingle with the airs near of the near reaches. Demeaux's Gate, named for a navigator lost above. How did his bones come below?
- /January 6th, 1888/: Fed the crew.
- /January 7th, 1888/: An electric shiver to the air. Storm is watching, the zailors would say.
- /January 7th, 1888/: Creeping tendirs of fungus, zee-weed, unnamable flora. We enter /the Snares/.
- /January 7th, 1888/: Discovered Labyrinth of Eels!
- /January 7th, 1888/: Discovered Crabcake!
- /January 8th, 1888/: Home. Warmly lit windows, company, peace. Thoughts of home come at the strangest times.
- /January 8th, 1888/: Discovered Pigmote Isle!
- /January 8th, 1888/: Fed the crew.
- /January 8th, 1888/: Discovered Saints-Haven.
- /January 8th, 1888/: Discovered a Rat-Barge from The dark Underzee!
- /January 8th, 1888/: The zee here is warmm. Bubbles rise and burst with lazy menace. The fire in the earth is restless.
- ~Suffered 10 damage!~
- /January 10th, 1888/: A zailor is praying.
- /January 10th, 1888/: Fed the crew.
- /January 11th, 1888/: Green glass and basalt. Salt and silence.
- /January 11th, 1888/: Discovered Velten's Vortex!
- /January 11th, 1888/: The Carnelian Coast. Far to the South, the Neath-roof glimmers above the Mountain of Light.
- /January 11th, 1888/: Discovered the Rainer's Vortex!
- /January 12th, 1888/: A false-star flares in the cavern roof directly above you; flares, and fades.
- /January 12th, 1888/: Discovered Rolias Bluff!
- /January 12th, 1888/: Fed the crew.
- /January 12th, 1888/: Discovered Port Carnelian!

