examples/SunlessSea/Captain II.html

<div id="outline-container-org0f5d1ca" class="outline-2">
<h2 id="org0f5d1ca">FIRE!</h2>
<div class="outline-text-2" id="text-org0f5d1ca">
<p>
You've pushed your engines too far, too fast! Zailors scream - flames rage -
</p>

<ul class="org-ul">
<li><code>Heal the wounded, damp the flames</code></li>
</ul>

<p>
Do what you can -
</p>

<p>
<b>Bandaging the wounded</b>
</p>

<p>
You've saved injured zailors. But the ship has suffered terribly -
</p>
</div>
</div>

<div id="outline-container-org84d03db" class="outline-2">
<h2 id="org84d03db">BATTLE RESULT II</h2>
<div class="outline-text-2" id="text-org84d03db">
</div>
<div id="outline-container-org5160447" class="outline-3">
<h3 id="org5160447">You've Destroyed The Unfinished Revolutionaries</h3>
<div class="outline-text-3" id="text-org5160447">
<p>
Fragements of clay litter acroos the deck. They crunch underfoot like postherds. Unfinished men do not surrender.
</p>

<ul class="org-ul">
<li><code>Investigate the hold</code></li>
</ul>

<p>
What treasure did these villains take?
</p>
</div>
</div>

<div id="outline-container-org64878e1" class="outline-3">
<h3 id="org64878e1">Opening A  Cache Of Curiosities</h3>
<div class="outline-text-3" id="text-org64878e1">
<p>
What's inside?
</p>

<ul class="org-ul">
<li><code>A stout crate</code></li>
</ul>

<p>
Crates! The source of sustenance: the fundamental element of cargo.
</p>

<p>
<b>A crate of fuel</b>
</p>

<p>
Coke! Like coal, but more so, as the Department of Infernal Rarefactions would have it.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf79fe87" class="outline-2">
<h2 id="orgf79fe87">A White Zee-Bat</h2>
<div class="outline-text-2" id="text-orgf79fe87">
<p>
A zailor has grown fretful and disobedient, reluctant to go on deck, even in port. "There's a white zee-bat watching me up there. Salt's messenger. Salt's got its eye on me. I'll never see home again."
</p>

<ul class="org-ul">
<li><code>Salt</code></li>
</ul>

<p>
One of the nameless god that zailors fear. This zailor is a conscientious man. Sen him to the sick bay on the pretext of a fever.
</p>

<p>
<b>And onwards</b>
</p>

<p>
The zailor is grateful, though your ship's doctor rolls a sceptical eye. When he next goes up on deck, the railings are clear of zee-bats, white or black, and he sets to work with a will. 
</p>
</div>
</div>

<div id="outline-container-org2be8d29" class="outline-2">
<h2 id="org2be8d29">Cumaean Canal Staging Area</h2>
<div class="outline-text-2" id="text-org2be8d29">
<p>
Here, the dark waters run down from the surface, from a brighter sea&#x2026; 
</p>

<p>
The Canal ascends, through locks and gates and shadowed turns, to the sunlight of the Surface.
</p>

<ul class="org-ul">
<li><code>Gather information for a Port Report</code></li>
</ul>

<p>
Many ships pass this way, but perhaps you will pick up something they missed.
</p>

<p>
<b>Bussiness as usual</b>
</p>

<p>
The gates open and shuts. The locks remain free from sabotage. If anywhere besides London is safe in all the Underzee, it's here. The Surface nations have an interest in keeping the way open.
</p>

<ul class="org-ul">
<li><code>Listen for Surface gossip</code></li>
</ul>

<p>
The ships of Surface linger here: this is their life-line to a warmer place.
</p>

<p>
<b>A sorry end</b>
</p>

<p>
A card game ends badly when one Surface sailor knifes other for all the usual reasons. The other players scrabble for the coins spill from her pockets, but you snatch up a scrap of paper they overlook. Curious markings: dates, times, code-names. Spy's work?
</p>
</div>

<div id="outline-container-orgb12dcbe" class="outline-3">
<h3 id="orgb12dcbe">Shops</h3>
<div class="outline-text-3" id="text-orgb12dcbe">
<ul class="org-ul">
<li><p>
<b>Harbour Provisioners</b>
</p>

<p>
A sluggish and hostile merchant squints warily. A few goods of indifferently quality are available.
</p>

<ul class="org-ul">
<li>Fuel

<ul class="org-ul">
<li><code>Buy: €20, Sell: €1</code></li>
</ul></li>

<li>Supplies

<ul class="org-ul">
<li><code>Buy: €30, Sell: €5</code></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org42f6aff" class="outline-2">
<h2 id="org42f6aff">Sailing Logbook</h2>
<div class="outline-text-2" id="text-org42f6aff">
<ul class="org-ul">
<li><i>January 5th, 1888</i>: Discovered The Echo Bazaar!</li>
<li><i>January 5th, 1888</i>: Discovered Dept. of Menace Eradication!</li>
<li><i>January 6th, 1888</i>: A zailor is praying.</li>
<li><i>January 6th, 1888</i>: Discovered Badstevener's Abyss!</li>
<li><i>January 6th, 1888</i>: Discovered Rowena's Rocks!</li>
<li><i>January 6th, 1888</i>: Discovered Moody's Light!</li>
<li><i>January 6th, 1888</i>: Discovered Purewal Point!</li>
<li><i>January 6th, 1888</i>: Here the wilder airs mingle with the airs near of the near reaches. Demeaux's Gate, named for a navigator lost above. How did his bones come below?</li>
<li><i>January 6th, 1888</i>: Fed the crew.</li>
<li><i>January 7th, 1888</i>: An electric shiver to the air. Storm is watching, the zailors would say.</li>
<li><i>January 7th, 1888</i>: Creeping tendirs of fungus, zee-weed, unnamable flora. We enter <i>the Snares</i>.</li>
<li><i>January 7th, 1888</i>: Discovered Labyrinth of Eels!</li>
<li><i>January 7th, 1888</i>: Discovered Crabcake!</li>
<li><i>January 8th, 1888</i>: Home. Warmly lit windows, company, peace. Thoughts of home come at the strangest times.</li>
<li><i>January 8th, 1888</i>: Discovered Pigmote Isle!</li>
<li><i>January 8th, 1888</i>: Fed the crew.</li>
<li><i>January 8th, 1888</i>: Discovered Saints-Haven.</li>
<li><i>January 8th, 1888</i>: Discovered a Rat-Barge from The dark Underzee!</li>
<li><i>January 8th, 1888</i>: The zee here is warmm. Bubbles rise and burst with lazy menace. The fire in the earth is restless.</li>
<li><code>Suffered 10 damage!</code></li>
<li><i>January 10th, 1888</i>: A zailor is praying.</li>
<li><i>January 10th, 1888</i>: Fed the crew.</li>
<li><i>January 11th, 1888</i>: Green glass and basalt. Salt and silence.</li>
<li><i>January 11th, 1888</i>: Discovered Velten's Vortex!</li>
<li><i>January 11th, 1888</i>: The Carnelian Coast. Far to the South, the Neath-roof glimmers above the Mountain of Light.</li>
<li><i>January 11th, 1888</i>: Discovered the Rainer's Vortex!</li>
<li><i>January 12th, 1888</i>: A false-star flares in the cavern roof directly above you; flares, and fades.</li>
<li><i>January 12th, 1888</i>: Discovered Rolias Bluff!</li>
<li><i>January 12th, 1888</i>: Fed the crew.</li>
<li><i>January 12th, 1888</i>: Discovered Port Carnelian!</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Last modified: 2021-11-25 周四 12:45</p>
</div>
</body>
</html>
